app/views/posts/edit.html.erb


<% if @post.comments.length > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]