app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
        <td><%= post.user.email %></td>
        <td><%= post.comments.length %></td>