app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "post_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdasdfasdf"], ["created_at", Wed, 15 Jan 2014 15:00:22 UTC +00:00], ["post_id", 2], ["title", "faasdfasd"], ["updated_at", Wed, 15 Jan 2014 15:00:22 UTC +00:00]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["user_id", 2], ["updated_at", Wed, 15 Jan 2014 15:00:22 UTC +00:00]]
---
  def create
    @comment = @post.comments.create(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
    def set_comment
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])