app/controllers/posts_controller.rb

  def create

    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "内容\r\n第二行。\r\n恩。\r\n\r\n<p>asdf</p>"], ["created_at", Wed, 15 Jan 2014 14:42:04 UTC +00:00], ["title", "测试哈哈哈"], ["updated_at", Wed, 15 Jan 2014 14:42:04 UTC +00:00], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["body", "阿斯蒂芬斯蒂芬 爱上 水电费"], ["updated_at", Wed, 15 Jan 2014 16:46:09 UTC +00:00]]